# Agribot YOLOv8 Configuration
# Includes: BiFPN, SimAM+EMA, P2 Head

# Parameters
nc: 2  # number of classes (crop, weed)
scales: # n, s, m, l, x
  n: [0.33, 0.25, 1024] 

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9

# Head (Neck + Detect)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 4], 1, Concat, [1]] # 14
  - [-1, 3, C2f, [256]] # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [[-1, 2], 1, Concat, [1]] # 17
  - [-1, 3, C2f, [128]] # 18 (P2 output)

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 15, 4], 1, Concat, [1]] # 20
  - [-1, 3, C2f, [256]] # 21 (P3 output)

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 12, 6], 1, Concat, [1]] # 23
  - [-1, 3, C2f, [512]] # 24 (P4 output)

  - [-1, 1, Conv, [1024, 3, 2]] # 25
  - [[-1, 9, 8], 1, Concat, [1]] # 26
  - [-1, 3, C2f, [1024]] # 27 (P5 output)

  - [[18, 21, 24, 27], 1, Detect, [nc]] # 28
